importPackage(java.lang);
﻿var books1_1 = [];
﻿var books2_1 = [];
//--------------------------------------------------위로는 건들 ㄴㄴ
//--------------------------------------------------위로는 건들 ㄴㄴ
//--------------------------------------------------위로는 건들 ㄴㄴ
//--------------------------------------------------위로는 건들 ㄴㄴ
//--------------------------------------------------위로는 건들 ㄴㄴ
var 보상아이템코드 = 2635156;
var 백퍼보상 = 2635156;
var 백퍼보상갯수 = 100;
var books1 = [//아이템코드 , 갯수 스텟, 공, 마
//등록아이템코드,갯수,보상아이템코드,보상갯수 
    [4000016, 200, 보상아이템코드, 100], // 빨달껍
    [4000037, 200, 보상아이템코드, 100], //버블링
    [4000009, 200, 보상아이템코드, 100], //파버섯갓
    [4000007, 200, 보상아이템코드, 100], //이블아이
    [4000051, 200, 보상아이템코드, 100], //전강의 독침
    [4000015, 200, 보상아이템코드, 100], //톱니바퀴
    [4000069, 200, 보상아이템코드, 100], //절구공이
    [4000072, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000027, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000063, 200, 보상아이템코드, 100], //출입증
    [4000017, 200, 보상아이템코드, 100], // 빨달껍
    [4000018, 200, 보상아이템코드, 100], //버블링
    [4000023, 200, 보상아이템코드, 100], //파버섯갓
    [4000040, 200, 보상아이템코드, 100], //이블아이
    [4000041, 200, 보상아이템코드, 100], //전강의 독침
    [4000042, 200, 보상아이템코드, 100], //톱니바퀴
    [4000043, 200, 보상아이템코드, 100], //절구공이
    [4000044, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000045, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000046, 200, 보상아이템코드, 100],
    [4000047, 200, 보상아이템코드, 100], // 빨달껍
    [4000048, 200, 보상아이템코드, 100], //버블링
    [4000049, 200, 보상아이템코드, 100], //파버섯갓
    [4000050, 200, 보상아이템코드, 100], //50
    [4000051, 200, 보상아이템코드, 100], //전강의 독침
    [4000052, 200, 보상아이템코드, 100], //톱니바퀴
    [4000053, 200, 보상아이템코드, 100], //절구공이
    [4000054, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000055, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000056, 200, 보상아이템코드, 100], //출입증
    [4000057, 200, 보상아이템코드, 100], // 빨달껍
    [4000058, 200, 보상아이템코드, 100], //버블링
    [4000059, 200, 보상아이템코드, 100], //파버섯갓
    [4000060, 200, 보상아이템코드, 100], //이블아이
    [4000061, 200, 보상아이템코드, 100], //전강의 독침
    [4000062, 200, 보상아이템코드, 100], //톱니바퀴
    [4000130, 200, 보상아이템코드, 100], //절구공이
    [4000064, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000065, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000066, 200, 보상아이템코드, 100],
    [4000067, 200, 보상아이템코드, 100], // 빨달껍
    [4000068, 200, 보상아이템코드, 100], //버블링
    [4000069, 200, 보상아이템코드, 100], //파버섯갓
    [4000070, 200, 보상아이템코드, 100], //이블아이
    [4000071, 200, 보상아이템코드, 100], //전강의 독침
    [4000072, 200, 보상아이템코드, 100], //톱니바퀴
    [4000073, 200, 보상아이템코드, 100], //절구공이
    [4000074, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000075, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000076, 200, 보상아이템코드, 100], //출입증
    [4000077, 200, 보상아이템코드, 100], // 빨달껍
    [4000078, 200, 보상아이템코드, 100], //버블링
    [4000079, 200, 보상아이템코드, 100], //파버섯갓
    [4000080, 200, 보상아이템코드, 100], //이블아이
    [4000081, 200, 보상아이템코드, 100], //전강의 독침
    [4000082, 200, 보상아이템코드, 100], //톱니바퀴
    [4033920, 200, 보상아이템코드, 100], //절구공이
    [4000084, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000085, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000086, 200, 보상아이템코드, 100],
    [4000087, 200, 보상아이템코드, 100], // 빨달껍
    [4000088, 200, 보상아이템코드, 100], //버블링
    [4000100, 200, 보상아이템코드, 100], //파버섯갓
    [4000101, 200, 보상아이템코드, 100], //이블아이
    [4000102, 200, 보상아이템코드, 100], //전강의 독침
    [4000092, 200, 보상아이템코드, 100], //톱니바퀴
    [4000093, 200, 보상아이템코드, 100], //절구공이
    [4000094, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000095, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000096, 200, 보상아이템코드, 100], //출입증
    [4000097, 200, 보상아이템코드, 100], // 빨달껍
    [4000098, 200, 보상아이템코드, 100], //버블링
    [4000099, 200, 보상아이템코드, 100], //파버섯갓
    [4000103, 200, 보상아이템코드, 100], //이블아이
    [4000104, 200, 보상아이템코드, 100], //전강의 독침
    [4000105, 200, 보상아이템코드, 100], //톱니바퀴
    [4000106, 200, 보상아이템코드, 100], //절구공이
    [4000107, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000108, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000109, 200, 보상아이템코드, 100],
    [4000110, 200, 보상아이템코드, 100], // 빨달껍
    [4000111, 200, 보상아이템코드, 100], //버블링
    [4000112, 200, 보상아이템코드, 100], //파버섯갓
    [4000113, 200, 보상아이템코드, 100], //이블아이
    [4000114, 200, 보상아이템코드, 100], //전강의 독침
    [4000115, 200, 보상아이템코드, 100], //톱니바퀴
    [4000116, 200, 보상아이템코드, 100], //절구공이
    [4000117, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000118, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000119, 200, 보상아이템코드, 100], //출입증
    [4000120, 200, 보상아이템코드, 100], // 빨달껍
    [4000121, 200, 보상아이템코드, 100], //버블링
    [4000122, 200, 보상아이템코드, 100], //파버섯갓
    [4000123, 200, 보상아이템코드, 100], //이블아이
    [4000124, 200, 보상아이템코드, 100], //전강의 독침
    [4000125, 200, 보상아이템코드, 100], //톱니바퀴
    [4000126, 200, 보상아이템코드, 100], //절구공이
    [4000127, 200, 보상아이템코드, 100], //삼미호의 꼬
    [4000128, 200, 보상아이템코드, 100], //와일드카고 눈동자
    [4000129, 200, 보상아이템코드, 100],
];
var books2 = [//아이템코드 , 갯수 스텟, 공, 마
//등록아이템코드,갯수,보상아이템코드,보상갯수 
    [1012792, 1, 보상아이템코드, 100], // 초LUNA 마크
    [1022340, 1, 보상아이템코드, 100], //초LUNA 안대
    [1032460, 1, 보상아이템코드, 100], //이어링
    [1122640, 1, 보상아이템코드, 100], //스타펜던트
    [1122641, 1, 보상아이템코드, 100], // 문펜던트
    [1132460, 1, 보상아이템코드, 100], // 벨트
    [1152344, 1, 보상아이템코드, 100], //견장
    [1162160, 1, 보상아이템코드, 100], //적구슬
    [1182360, 1, 보상아이템코드, 100], //뱃지
    [1190345, 1, 보상아이템코드, 100], // 엠블렘
    [1008110, 1, 보상아이템코드, 100], // 헬멧
    [1103610, 1, 보상아이템코드, 100], //망토
    [1042810, 1, 보상아이템코드, 100], //셔츠
    [1082910, 1, 보상아이템코드, 100], //장갑
    [1062510, 1, 보상아이템코드, 100], // 팬츠
    [1073810, 1, 보상아이템코드, 100], //신발
    [1113610, 1, 보상아이템코드, 100], //블루링
    [1113611, 1, 보상아이템코드, 100], // 레드링
    [1113612, 1, 보상아이템코드, 100], //그린링
    [1113613, 1, 보상아이템코드, 100], //퍼플링
    [1672250, 1, 보상아이템코드, 100], // 하트
    [1012794, 1, 보상아이템코드, 100], // 라이징 마크
    [1022360, 1, 보상아이템코드, 100], // 안대
    [1032480, 1, 보상아이템코드, 100], //이어링
    [1122660, 1, 보상아이템코드, 100], //스타펜던트
    [1122661, 1, 보상아이템코드, 100], // 문펜던트
    [1132480, 1, 보상아이템코드, 100], // 벨트
    [1152364, 1, 보상아이템코드, 100], //견장
    [1162180, 1, 보상아이템코드, 100], //적구슬
    [1182380, 1, 보상아이템코드, 100], //뱃지
    [1190365, 1, 보상아이템코드, 100], // 엠블렘
    [1008130, 1, 보상아이템코드, 100], // 헬멧
    [1103630, 1, 보상아이템코드, 100], //망토
    [1042830, 1, 보상아이템코드, 100], //셔츠
    [1082930, 1, 보상아이템코드, 100], //장갑
    [1062530, 1, 보상아이템코드, 100], // 팬츠
    [1073830, 1, 보상아이템코드, 100], //신발
    [1113630, 1, 보상아이템코드, 100], //블루링
    [1113631, 1, 보상아이템코드, 100], // 레드링
    [1113632, 1, 보상아이템코드, 100], //그린링
    [1113633, 1, 보상아이템코드, 100], //퍼플링
    [1672270, 1, 보상아이템코드, 100], // 하트
    [1012795, 1, 보상아이템코드, 100], // 초라이징 마크
    [1022370, 1, 보상아이템코드, 100], // 안대
    [1032490, 1, 보상아이템코드, 100], //이어링
    [1122670, 1, 보상아이템코드, 100], //스타펜던트
    [1122671, 1, 보상아이템코드, 100], // 문펜던트
    [1132490, 1, 보상아이템코드, 100], // 벨트
    [1152374, 1, 보상아이템코드, 100], //견장
    [1162190, 1, 보상아이템코드, 100], //적구슬
    [1182390, 1, 보상아이템코드, 100], //뱃지
    [1190375, 1, 보상아이템코드, 100], // 엠블렘
    [1008140, 1, 보상아이템코드, 100], // 헬멧
    [1103640, 1, 보상아이템코드, 100], //망토
    [1042840, 1, 보상아이템코드, 100], //셔츠
    [1082940, 1, 보상아이템코드, 100], //장갑
    [1062540, 1, 보상아이템코드, 100], // 팬츠
    [1073840, 1, 보상아이템코드, 100], //신발
    [1113640, 1, 보상아이템코드, 100], //블루링
    [1113641, 1, 보상아이템코드, 100], // 레드링
    [1113642, 1, 보상아이템코드, 100], //그린링
    [1113643, 1, 보상아이템코드, 100], //퍼플링
    [1672280, 1, 보상아이템코드, 100], // 하트
    [1012260, 1, 보상아이템코드, 300], // 커스텀 마크
    [1022073, 1, 보상아이템코드, 300], // 안대
    [1032160, 1, 보상아이템코드, 300], //이어링
    [1122007, 1, 보상아이템코드, 300], //스타펜던트
    [1122058, 1, 보상아이템코드, 300], // 문펜던트
    [1152074, 1, 보상아이템코드, 300], // 벨트
    [1162004, 1, 보상아이템코드, 300], //견장
    [1182263, 1, 보상아이템코드, 300], //적구슬
    [1190313, 1, 보상아이템코드, 300], //뱃지
    [1002026, 1, 보상아이템코드, 300], // 엠블렘
    [1102369, 1, 보상아이템코드, 300], // 헬멧
    [1042352, 1, 보상아이템코드, 300], //망토
    [1082145, 1, 보상아이템코드, 300], //셔츠
    [1062000, 1, 보상아이템코드, 300], //장갑
    [1072369, 1, 보상아이템코드, 300], // 팬츠
    [1662183, 1, 보상아이템코드, 300], //신발
    [1113510, 1, 보상아이템코드, 300], //블루링
    [1113511, 1, 보상아이템코드, 300], // 레드링
    [1113512, 1, 보상아이템코드, 300], //그린링
    [1113513, 1, 보상아이템코드, 300], //퍼플링
    [1672028, 1, 보상아이템코드, 300], // 하트
	[1012820, 1, 보상아이템코드, 300], // 커스텀2기 마크
    [1022400, 1, 보상아이템코드, 300], // 안대
    [1032520, 1, 보상아이템코드, 300], //이어링
    [1122700, 1, 보상아이템코드, 300], //스타펜던트
    [1122701, 1, 보상아이템코드, 300], // 문펜던트
    [1132520, 1, 보상아이템코드, 300], // 벨트
    [1152404, 1, 보상아이템코드, 300], //견장
    [1162420, 1, 보상아이템코드, 300], //적구슬
    [1182420, 1, 보상아이템코드, 300], //뱃지
    [1190405, 1, 보상아이템코드, 300], // 엠블렘
    [1008170, 1, 보상아이템코드, 300], // 헬멧
    [1103670, 1, 보상아이템코드, 300], //망토
    [1042870, 1, 보상아이템코드, 300], //셔츠
    [1082970, 1, 보상아이템코드, 300], //장갑
    [1062570, 1, 보상아이템코드, 300], // 팬츠
    [1073870, 1, 보상아이템코드, 300], //신발
    [1113670, 1, 보상아이템코드, 300], //블루링
    [1113671, 1, 보상아이템코드, 300], // 레드링
    [1113672, 1, 보상아이템코드, 300], //그린링
    [1113673, 1, 보상아이템코드, 300], //퍼플링
    [1672310, 1, 보상아이템코드, 300], // 하트
    [1014110, 1, 보상아이템코드, 1000], // 후원 LUNA널 메모리즈 마크
    [1022560, 1, 보상아이템코드, 1000], // 안대
    [1032680, 1, 보상아이템코드, 1000], //이어링
    [1124110, 1, 보상아이템코드, 1000], //스타펜던트
    [1124111, 1, 보상아이템코드, 1000], // 문펜던트
    [1132680, 1, 보상아이템코드, 1000], // 벨트
    [1152564, 1, 보상아이템코드, 1000], //견장
    [1162580, 1, 보상아이템코드, 1000], //적구슬
    [1182580, 1, 보상아이템코드, 1000], //뱃지
    [1192110, 1, 보상아이템코드, 1000], // 엠블렘
    [1008330, 1, 보상아이템코드, 1000], // 헬멧
    [1103830, 1, 보상아이템코드, 1000], //망토
    [1044130, 1, 보상아이템코드, 1000], //셔츠
    [1083130, 1, 보상아이템코드, 1000], //장갑
    [1062730, 1, 보상아이템코드, 1000], // 팬츠
    [1074030, 1, 보상아이템코드, 1000], //신발
    [1114130, 1, 보상아이템코드, 1000], //블루링
    [1114131, 1, 보상아이템코드, 1000], // 레드링
    [1114132, 1, 보상아이템코드, 1000], //그린링
    [1114133, 1, 보상아이템코드, 1000], //퍼플링
    [1672470, 1, 보상아이템코드, 1000], // 하트
	[1012830, 1, 보상아이템코드, 1000], // 후원커스텀 마크
    [1022410, 1, 보상아이템코드, 1000], // 안대
    [1032530, 1, 보상아이템코드, 1000], //이어링
    [1122710, 1, 보상아이템코드, 1000], //스타펜던트
    [1122711, 1, 보상아이템코드, 1000], // 문펜던트
    [1132530, 1, 보상아이템코드, 1000], // 벨트
    [1152414, 1, 보상아이템코드, 1000], //견장
    [1162430, 1, 보상아이템코드, 1000], //적구슬
    [1182430, 1, 보상아이템코드, 1000], //뱃지
    [1190415, 1, 보상아이템코드, 1000], // 엠블렘
    [1008180, 1, 보상아이템코드, 1000], // 헬멧
    [1103680, 1, 보상아이템코드, 1000], //망토
    [1042880, 1, 보상아이템코드, 1000], //셔츠
    [1082980, 1, 보상아이템코드, 1000], //장갑
    [1062580, 1, 보상아이템코드, 1000], // 팬츠
    [1073880, 1, 보상아이템코드, 1000], //신발
    [1113680, 1, 보상아이템코드, 1000], //블루링
    [1113681, 1, 보상아이템코드, 1000], // 레드링
    [1113682, 1, 보상아이템코드, 1000], //그린링
    [1113683, 1, 보상아이템코드, 1000], //퍼플링
    [1672320, 1, 보상아이템코드, 1000], // 하트
];
//#fUI/UIWindow.img/Quest/notice/1#
function start() {
    선언();
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0 || mode == -1) {
        cm.sendOk("다음에또 이용해주세요!");
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    }
    if (status == 0) {
        var message = "#d#e#i4031298#컬렉션 시스템#k#n\r\n\r\n";
        message += "#b#e[재료 컬렉션]#k#n\r\n";
        message += "#L1##b#i1322031#[PRAY] 기타도감 #k#l\r\n";
        message += "#L2##b#i1322031#[PRAY] 장비도감 #k#l\r\n";
        cm.sendSimple(message);
    } else if (status == 1) {
        selet = selection;
        if (selet == 1) { //boo1
            var message = "#d#e#h ##n#k님의 #d컬렉션 I#k\r\n\r\n";
            message += "#d컬렉션 I#k 완성도 : #B" + 퍼센트().toFixed(2) + "# #b[" + 퍼센트().toFixed(2) + "%]#k\r\n";
            message += "#L9999##b#e#i1132152:# 컬렉션 I 100% 보상받기#n#k\r\n";
            for (var i = 0; i < books1.length; i++) {
                if (i % 3 == 0) {
                    message += "\r\n"
                }
                if (books1_1[i] == 0) {
                    message += "#L" + i + "##i" + books1[i][0] + "# #r[미등록]#k";
                } else {
                    message += "#L" + i + "##i" + books1[i][0] + "##e#b[등록됨]#n#k";
                }
            }
            cm.sendSimple(message);
        } else if (selet == 2) { //boo2
            var message = "#d#e#h ##n#k님의 #d컬렉션 I#k\r\n\r\n";
            message += "#d컬렉션 ll#k 완성도 : #B" + 퍼센트2().toFixed(2) + "# #b[" + 퍼센트2().toFixed(2) + "%]#k\r\n";
            message += "#L9998##b#e#i1132152:# 컬렉션 lI 100% 보상받기#n#k\r\n";
            for (var i = 1000; i < books2.length + 1000; i++) {
                if ((i - 1000) % 3 == 0) {
                    message += "\r\n"
                }
                if (books2_1[((i - 1000))] == 0) {
                    message += "#L" + i + "##i" + books2[(i - 1000)][0] + "# #r[미등록]#k";
                } else {
                    message += "#L" + i + "##i" + books2[(i - 1000)][0] + "##e#b[등록됨]#n#k";
                }
            }
            cm.sendSimple(message);
        }
    } else if (status == 2) {
        sel = selection;
        if (sel < 1000) { //boo1
            if (selet == 1) {
                if (books1_1[sel] == 1) {
                    var mess = "이미 등록된 도감입니다.\r\n";
                    mess += "#b#e[등록 보상]\r\n #i" + books1[sel][2] + "##z" + books1[sel][2] + "# " + books1[sel][3] + "개";
                    cm.sendOk(mess);
                    cm.dispose();
                    return;
                } else {
                    var t = "";
                    t += "#r#i" + books1[sel][0] + "##z" + books1[sel][0] + "#의 #d컬렉션#k을 등록하려면 아래의 재료를 모아오세요\r\n";
                    t += "#r#i" + books1[sel][0] + "##z" + books1[sel][0] + "# " + cm.itemQuantity(books1[sel][0]) + " / " + books1[sel][1] + "개 " + (cm.itemQuantity(books1[sel][0]) >= books1[sel][1] ? "#e#b[등록가능]#k#n" : "#r#e[등록불가]#k#n") + "\r\n\r\n";
                    t += "#b#e[등록 보상]\r\n #i" + books1[sel][2] + "##z" + books1[sel][2] + "# " + books1[sel][3] + "개\r\n";
                    t += "#d컬렉션#k에 등록하시겠습니까??";
                    cm.sendYesNo(t);
                }
            }
        } else if (sel >= 1000 && sel < 2000) { //boo2
            sel = sel - 1000;
            if (selet == 2) {
                if (books2_1[sel] == 1) {
                    var mess = "이미 등록된 도감입니다.\r\n";
                    mess += "#b#e[등록 보상]\r\n #i" + books2[sel][2] + "##z" + books2[sel][2] + "# " + books2[sel][3] + "개";
                    cm.sendOk(mess);
                    cm.dispose();
                    return;
                } else {
                    var t = "";
                    t += "#r#i" + books2[sel][0] + "##z" + books2[sel][0] + "#의 #d컬렉션#k을 등록하려면 아래의 재료를 모아오세요\r\n";
                    t += "#r#i" + books2[sel][0] + "##z" + books2[sel][0] + "# " + cm.itemQuantity(books2[sel][0]) + " / " + books2[sel][1] + "개 " + (cm.itemQuantity(books2[sel][0]) >= books2[sel][1] ? "#e#b[등록가능]#k#n" : "#r#e[등록불가]#k#n") + "\r\n\r\n";
                    t += "#b#e[등록 보상]\r\n #i" + books2[sel][2] + "##z" + books2[sel][2] + "# " + books2[sel][3] + "개\r\n";
                    t += "#d컬렉션#k에 등록하시겠습니까??";
                    cm.sendYesNo(t);
                }
            }
        } else if (sel == 9999) {
            checkker = true;
            for (var i = 0; i < books1.length; i++) {
                if (books1_1[i] == 0) {
                    checkker = false;
                }
            }
            if (checkker) {
                if (cm.getPlayer().getKeyValuechr("booksfinsh") == "0") {//컬렉션100퍼달성보상체크
                    cm.getPlayer().setKeyValuechr("booksfinsh", "1", true);
                    cm.gainItem(백퍼보상, 백퍼보상갯수); //컬렉션 100퍼보상 
                    cm.sendOk("컬렉션완성도 100%보상인 #b#i" + 백퍼보상 + ":##z" + 백퍼보상 + "##k" + 백퍼보상갯수 + "개가 지급되었습니다.");
                    cm.dispose();
                    return;
                } else {
                    cm.sendOk("#r이미 컬렉션 완성도 100%보상을 받으셨습니다.#k");
                    cm.dispose();
                    return;
                }
            } else {
                cm.sendOk("#r컬렉션 완성도가 100%가 아닙니다. 컬렉션 완성도를 100% 채워주세요!#k");
                cm.dispose();
                return;
            }
        } else if (sel == 9998) {
            checkker = true;
            for (var i = 0; i < books2.length; i++) {
                if (books2_1[i] == 0) {
                    checkker = false;
                }
            }
            if (checkker) {
                if (cm.getPlayer().getKeyValuechr("booksfinsh2") == "0") {//컬렉션100퍼달성보상체크
                    cm.getPlayer().setKeyValuechr("booksfinsh2", "1", true);
                    cm.gainItem(백퍼보상, 백퍼보상갯수); //컬렉션 100퍼보상 
                    cm.sendOk("컬렉션완성도 100%보상인 #b#i" + 백퍼보상 + ":##z" + 백퍼보상 + "##k" + 백퍼보상갯수 + "개가 지급되었습니다.");
                    cm.dispose();
                    return;
                } else {
                    cm.sendOk("#r이미 컬렉션 완성도 100%보상을 받으셨습니다.#k");
                    cm.dispose();
                    return;
                }
            } else {
                cm.sendOk("#r컬렉션 완성도가 100%가 아닙니다. 컬렉션 완성도를 100% 채워주세요!#k");
                cm.dispose();
                return;
            }
        }
    } else if (status == 3) {
        if (selet == 1) { //boo1
            if (cm.haveItem(books1[sel][0], books1[sel][1])) {
                if (cm.canHold(books1[sel][2])) {
                    cm.gainItem(books1[sel][0], -books1[sel][1]);
                    var cucu = "";
                    for (var i = 0; i < books1_1.length; i++) {
                        if (i == sel) {
                            cucu += "1,";
                        } else {
                            cucu += "" + books1_1[i] + ",";
                        }
                    }
                    cm.getPlayer().setKeyValuechr("books1", cucu, true);//랜덤아이템 + 갯수 저장
                    var text = "#b#i" + books1[sel][0] + "##z" + books1[sel][0] + "# #d컬렉션#k이 정상 등록되었습니다.#k\r\n\r\n";
                    text += "#b#e[등록 보상]\r\n #i" + books1[sel][2] + "##z" + books1[sel][2] + "# " + books1[sel][3] + "개 ";
                    cm.gainItem(books1[sel][2], books1[sel][3]);
                    cm.sendOk(text);
                    cm.dispose();
                    return;
                } else {
                    cm.sendOk("보상받을 인벤토리 공간이 부족합니다.");
                    cm.dispose();
                }
//            status = -1;
            } else {
                cm.sendOk("#r#i" + books1[sel][0] + "##z" + books1[sel][0] + "# #d컬렉션#k에 등록할 재료가 부족합니다.#k");
                cm.dispose();
                return;
            }
        } else if (selet == 2) { //boo2
            if (cm.haveItem(books2[sel][0], books2[sel][1])) {
                if (cm.canHold(books2[sel][2])) {
//                    cm.gainItem(books2[sel][0], -books2[sel][1]);
                    var cucu = "";
                    for (var i = 0; i < books2_1.length; i++) {
                        if (i == sel) {
                            cucu += "1,";
                        } else {
                            cucu += "" + books2_1[i] + ",";
                        }
                    }
                    cm.getPlayer().setKeyValuechr("books2", cucu, true);//랜덤아이템 + 갯수 저장
                    var text = "#b#i" + books2[sel][0] + "##z" + books2[sel][0] + "# #d컬렉션#k이 정상 등록되었습니다.#k\r\n\r\n";
                    text += "#b#e[등록 보상]\r\n #i" + books2[sel][2] + "##z" + books2[sel][2] + "# " + books2[sel][3] + "개 ";
                    cm.gainItem(books2[sel][2], books2[sel][3]);
                    cm.sendOk(text);
                    cm.dispose();
                    return;
                } else {
                    cm.sendOk("보상받을 인벤토리 공간이 부족합니다.");
                    cm.dispose();
                }
//            status = -1;
            } else {
                cm.sendOk("#r#i" + books2[sel][0] + "##z" + books2[sel][0] + "# #d컬렉션#k에 등록할 재료가 부족합니다.#k");
                cm.dispose();
                return;
            }
        }
    }
}


function 선언() {
    if (cm.getPlayer().getKeyValuechr("booksfinsh") == null) {//컬렉션100퍼달성보상체크
        cm.getPlayer().setKeyValuechr("booksfinsh", "0", true);
    }
    if (cm.getPlayer().getKeyValuechr("books1") == null) {
        var bookcheck1 = ""
        for (var i = 0; i < books1.length; i++) {
            bookcheck1 += ",0";
        }
        cm.getPlayer().setKeyValuechr("books1", bookcheck1, true);//랜덤아이템 + 갯수 저장
    }
    books1_1 = cm.getPlayer().getKeyValuechr("books1").split(",");
    if (books1.length != books1_1.length) {
        var bookcheck2 = "";
        for (var i = 0; i < (books1.length - books1_1.length); i++) {
            bookcheck2 += ",0";
        }

        cm.getPlayer().setKeyValuechr("books1", cm.getPlayer().getKeyValuechr("books1") + bookcheck2, true);//랜덤아이템 + 갯수 저장
    }
    books1_1 = cm.getPlayer().getKeyValuechr("books1").split(",");
//---------------------------------------------------------------------------------------------------------------------------------------
    if (cm.getPlayer().getKeyValuechr("booksfinsh2") == null) {//컬렉션100퍼달성보상체크
        cm.getPlayer().setKeyValuechr("booksfinsh2", "0", true);
    }
    if (cm.getPlayer().getKeyValuechr("books2") == null) {
        var bookcheck1 = ""
        for (var i = 0; i < books2.length; i++) {
            bookcheck1 += ",0";
        }
        cm.getPlayer().setKeyValuechr("books2", bookcheck1, true);//랜덤아이템 + 갯수 저장
    }
    books2_1 = cm.getPlayer().getKeyValuechr("books2").split(",");
    if (books2.length != books2_1.length) {
        var bookcheck2 = "";
        for (var i = 0; i < (books2.length - books2_1.length); i++) {
            bookcheck2 += ",0";
        }

        cm.getPlayer().setKeyValuechr("books2", cm.getPlayer().getKeyValuechr("books2") + bookcheck2, true);//랜덤아이템 + 갯수 저장
    }
    books2_1 = cm.getPlayer().getKeyValuechr("books2").split(",");
}

function 퍼센트() {
    var a = 0;
    var b = 0;
    for (var i = 0; i < books1.length; i++) {
        a++
    }
    for (var i = 0; i < books1_1.length; i++) {
        if (books1_1[i] == 1) {
            b++
        }
    }
    return b / a * 100.0;

}
function 퍼센트2() {
    var a = 0;
    var b = 0;
    for (var i = 0; i < books2.length; i++) {
        a++
    }
    for (var i = 0; i < books2_1.length; i++) {
        if (books2_1[i] == 1) {
            b++
        }
    }
    return b / a * 100.0;

}