/*
製作 : 又깡 
用途 : 勳章隨機抽取系統 
*/
 
importPackage(Packages.constants); 
importPackage(Packages.tools.packet); 
importPackage(Packages.constants.programs); 
importPackage(Packages.database); 
importPackage(java.lang); 
importPackage(Packages.handling.world); 
importPackage(java.sql); 
importPackage(java.util); 
importPackage(java.io); 
importPackage(java.awt); 
importPackage(Packages.client.items); 
importPackage(Packages.client.inventory); 
importPackage(Packages.server.items); 
importPackage(Packages.server); 
importPackage(Packages.tools); 
importPackage(Packages.server.Luna); 
importPackage(Packages.packet.creators); 
importPackage(Packages.launch.world); 
importPackage(Packages.main.world); 
importPackage(Packages.database.hikari); 
 
var status;
var select;
 
var 勳章列表 = new Array(1142661, 1142593, 1143029, 1142006, 1142440, 1142249, 1142013, 1142003, 1143114, 1142152, 1140002, 1141002, 1142000, 1142001, 1142002, 1142003, 1142004, 1142009, 1142010, 1142011, 1142012, 1142013, 1142014, 1142015, 1142016, 1142017, 1142018, 1142019, 1142020, 1142021, 1142022, 1142023, 1142024, 1142025, 1142026, 1142027, 1142028, 1142029, 1142030, 1142031, 1142032, 1142033, 1142034, 1142035, 1142036, 1142037, 1142038, 1142039, 1142040, 1142041, 1142042, 1142043, 1142044, 1142045, 1142046, 1142047, 1142048, 1142049, 1142050, 1142051, 1142052, 1142053, 1142054, 1142055, 1142056, 1142057, 1142058, 1142059, 1142060, 1142061, 1142062, 1142063, 1142064, 1142065, 1142066, 1142067, 1142068, 1142069, 1142070, 1142071, 1142072, 1142073, 1142074, 1142075, 1142076, 1142077, 1142078, 1142079, 1142080, 1142081, 1142082, 1142083, 1142084, 1142085, 1142086, 1142087, 1142088, 1142089, 1142090, 1142091, 1142092, 1142093, 1142094, 1142095, 1142096, 1142097, 1142098, 1142099, 1142100, 1142101, 1142107, 1142108, 1142109, 1142110, 1142111, 1142112, 1142113, 1142114, 1142115 ,1142116, 1142117, 1142118, 1142119, 1142120, 1142122, 1142123, 1142126, 1142134, 1142135, 1142136, 1142137, 1142138, 1142139, 1142141, 1142142, 1142143, 1142149, 1142150, 1142151, 1142166, 1142187, 1142190, 1142191, 1142217, 1142218, 1142295, 1142296, 1142297, 1142298, 1142299, 1142300, 1142301, 1142305, 1142306, 1142307, 1142329, 1142334, 1142335, 1142360, 1142373, 1142406, 1142408, 1142441, 1142442, 1142443, 1142457, 1142511, 1142512, 1142543, 1142569, 1142573, 1142627, 1142656, 1143174, 1143033, 1143008); // 可獲得的勳章ID
var 隨機獎勵 = new Array(1140002, 1141002, 1142000, 1142001, 1142002, 1142003, 1142004, 1142009, 1142010, 1142011, 1142012, 1142013, 1142014, 1142015, 1142016, 1142017, 1142018, 1142019, 1142020, 1142021, 1142022, 1142023, 1142024, 1142025, 1142026, 1142027, 1142028, 1142029, 1142030, 1142031, 1142032, 1142033, 1142034, 1142035, 1142036, 1142037, 1142038, 1142039, 1142040, 1142041, 1142042, 1142043, 1142044, 1142045, 1142046, 1142047, 1142048, 1142049, 1142050, 1142051, 1142052, 1142053, 1142054, 1142055, 1142056, 1142057, 1142058, 1142059, 1142060, 1142061, 1142062, 1142063, 1142064, 1142065, 1142066, 1142067, 1142068, 1142069, 1142070, 1142071, 1142072, 1142073, 1142074, 1142075, 1142076, 1142077, 1142078, 1142079, 1142080, 1142081, 1142082, 1142083, 1142084, 1142085, 1142086, 1142087, 1142088, 1142089, 1142090, 1142091, 1142092, 1142093, 1142094, 1142095, 1142096, 1142097, 1142098, 1142099, 1142100, 1142101, 1142107, 1142108, 1142109, 1142110, 1142111, 1142112, 1142113, 1142114, 1142115 ,1142116, 1142117, 1142118, 1142119, 1142120, 1142122, 1142123, 1142126, 1142134, 1142135, 1142136, 1142137, 1142138, 1142139, 1142141, 1142142, 1142143, 1142149, 1142150, 1142151, 1142166, 1142187, 1142190, 1142191, 1142217, 1142218, 1142295, 1142296, 1142297, 1142298, 1142299, 1142300, 1142301, 1142305, 1142306, 1142307, 1142329, 1142334, 1142335, 1142360, 1142373, 1142406, 1142408, 1142441, 1142442, 1142443, 1142457, 1142511, 1142512, 1142543, 1142569, 1142573, 1142627, 1142656, 1143174, 1143033); // 隨機池 
var 硬幣 = 2635911; // 消耗貨幣ID 
var 需求數量 = 200; // 每次抽取消耗數量 
var item = 0;
 
function start() {
    status = -1;
    action(1, 1, 0);
}
 
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose(); 
    } else {
        if (mode == 0) {
            cm.dispose(); 
            return;
        }
        if (mode == 1)
            status++;
        else 
            status--;
        if (status == 0) {
            var 對話 = "";
            對話 += "#fs15##fc0xFF000000#這裡準備了各種不同的勳章。#b\r\n";
            對話 += "隨機抽取 - #i2635911##z2635911# 200個\r\n";
            對話 += "#L1##d查看可獲得勳章清單#l\r\n";
            對話 += "#L0##d我要隨機抽取#l";
            cm.sendSimpleS( 對話,0x86);
        } else if (status == 1) {
            if (selection == 1) {
                var 清單 = "#fs15#\r\n#b";
                for (var i = 0; i < 勳章列表.length; i++) {
                    清單 += "#i" + 勳章列表[i] + "# ";//#z" + 勳章列表[i] + "#
                }
                cm.sendOkS( 清單,0x86);
                cm.dispose(); 
            } else {
                item = selection;
                if (!cm.haveItem( 硬幣, 需求數量)) {
                    cm.sendNextS("#fs15# 抽取所需的材料不足。",0x86);
                    cm.dispose(); 
                } else {
                    cm.sendYesNoS("#b#z"  + 硬幣 + "# #r" + 需求數量 + " 個#k 用於抽取，確定嗎？",0x86);
                }
            }
        } else if (status == 2) {
            var 獲取訊息 = "#fs15##fc0xFF000000#你抽中的勳章是！ #b";
            switch (item) {
                case 0:
                    var 隨機獎勵 = 隨機獎勵[Math.floor(Math.random() * 隨機獎勵.length)];
                    if (cm.canHold( 隨機獎勵)) {
                        var ItemInfo = Packages.server.MapleItemInformationProvider.getInstance().getEquipById( 隨機獎勵);
                        // 可在此處自訂勳章屬性（如取消註解下方代碼）
                        // ItemInfo.setUpgradeSlots(0); 
                        // ItemInfo.setStr(1); 
                        Packages.server.MapleInventoryManipulator.addFromDrop(cm.getClient(),  ItemInfo, true);
                        cm.gainItem( 硬幣, -需求數量);
                        cm.sendOkS( 獲取訊息 + "#i" + 隨機獎勵 + "# #z" + 隨機獎勵 + "#",0x86);
                    } else {
                        cm.sendOkS("#fs15# 背包空間不足，請清理後再試。",0x86);
                    }
                    cm.dispose(); 
                    break;
            }
        }
    }
}